results/perf/phase6/awq-20260923T220125Z/vllm_bench_serve/c64.log
INFO 09-23 15:38:52 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x2b543d0259e0>, seed=0, num_prompts=640, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', max_concurrency=64, model='qwen3-8b-awq', tokenizer='/weights/quantized/Qwen3-8B-awq-b968826d', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results/phase6/awq-20260923T220125Z/vllm_bench_serve', result_filename='vllm_bench_serve_c64.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 09-23 15:38:57 [datasets.py:517] Sampling input_len from [512, 512] and output_len from [256, 256]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
============ Serving Benchmark Result ============
Successful requests:                     640       
Maximum request concurrency:             64        
Benchmark duration (s):                  82.07     
Total input tokens:                      326632    
Total generated tokens:                  163840    
Request throughput (req/s):              7.80      
Output token throughput (tok/s):         1996.43   
Total Token throughput (tok/s):          5976.51   
---------------Time to First Token----------------
Mean TTFT (ms):                          442.65    
Median TTFT (ms):                        336.03    
P50 TTFT (ms):                           336.03    
P90 TTFT (ms):                           516.06    
P99 TTFT (ms):                           2440.62   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          30.39     
Median TPOT (ms):                        30.70     
P50 TPOT (ms):                           30.70     
P90 TPOT (ms):                           31.21     
P99 TPOT (ms):                           31.87     
---------------Inter-token Latency----------------
Mean ITL (ms):                           30.39     
Median ITL (ms):                         22.63     
P50 ITL (ms):                            22.63     
P90 ITL (ms):                            24.68     
P99 ITL (ms):                            171.22    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8191.72   
Median E2EL (ms):                        8181.22   
P50 E2EL (ms):                           8181.22   
P90 E2EL (ms):                           8373.73   
P99 E2EL (ms):                           10229.38  
==================================================
/usr/local/lib/python3.12/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:02 remaining
 |          | 00:02 elapsed, 141:01:04 remaining